app/controllers/audio_controller.rb

SELECT "audios".* FROM "audios"
---
    def index
        @audios = Audio.all

SELECT  "audios".* FROM "audios" WHERE "audios"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def show
        @audio = Audio.find(params[:id])

INSERT INTO "audios" ("file", "created_at", "updated_at", "name", "singer", "note", "url", "category") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        # if params[:audio].nil? # このバリデーションはpresent: trueで解消されない?
        #     flash[:error] = "ファイルが選択されてません"
        #     return render "new"
        # end
        @audio = Audio.new(audio_params(params))
        if @audio.save # ビックリマークが付くと例外になる

SELECT  "audios".* FROM "audios" WHERE "audios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        logger.debug "++++++++++++++"
        logger.debug @audio = Audio.find(params[:id])

SELECT  "audios".* FROM "audios" WHERE "audios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "audios" SET "note" = ?, "updated_at" = ? WHERE "audios"."id" = ?  [["note", "テスト"], ["updated_at", "2020-02-01 22:20:09.880554"], ["id", 1]]
---
    def update
        logger.debug "++++++++++++++"
        logger.debug @audio = Audio.find(params[:id])
        logger.debug "++++++++++++++"
        if @audio.update(audio_params(params))

SELECT  "audios".* FROM "audios" WHERE "audios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "audios" WHERE "audios"."id" = ?  [["id", 1]]
---
    def destroy
        logger.debug "++++++++++++++"
        logger.debug @audio = Audio.find(params[:id])
        logger.debug "++++++++++++++"
        if @audio.destroy