app/controllers/music_controller.rb

    def index
        @list = Song.all
---
SELECT "songs".* FROM "songs"